# Filtering and Ordering - Lab Assignment #3

## Introduction
In this lab, you will write more `SELECT` statements to solidify your ability to query a SQL database. You will also write more specific queries using the tools you learned in the previous lesson.

## Objectives
You will be able to:
* Write SQL queries to filter and order results
* Order the results of your queries by using `ORDER BY` (`ASC` & `DESC`)
* Limit the number of records returned by a query using `LIMIT`
* Filter results using `BETWEEN` and `IS NULL`

### Famous Dogs

Here's a database full of famous dogs!  The `dogs` table is populated with the following data:

|name      |age    |gender |breed           |temperament|hungry |
|----------|-------|-------|----------------|-----------|-------|
|Snoopy    |3      |M      |beagle          |friendly   |1      |
|McGruff   |10     |M      |bloodhound      |aware      |0      |
|Scooby    |6      |M      |great dane      |hungry     |1      |
|Little Ann|5      |F      |coonhound       |loyal      |0      |
|Pickles   |13     |F      |black lab       |mischievous|1      |
|Clifford  |4      |M      |big red         |smiley     |1      |
|Lassie    |7      |F      |collie          |loving     |1      |
|Snowy     |8      |F      |fox terrier     |adventurous|0      |
|NULL      |4      |M      |golden retriever|playful    |1      |

## Connecting to the Database

First, import sqlite3 and establish a connection to the database **dogs.db** in the data folder. Then, create a cursor object so that you can pass SQL queries to the database.

In [6]:
#Your code here; import sqlite, create a connection and then a cursor object
import sqlite3
import pandas as pd
conn = sqlite3.Connection("data/dogs.db")

## Queries

Display the outputs for each of the following query descriptions.

### Select the name and breed for all female dogs

In [9]:
#Your code here
q0 = """
SELECT name, breed, gender
FROM dogs
WHERE gender = 'F'
;
"""
pd.read_sql(q0, conn)

         name        breed gender
0  Little Ann    coonhound      F
1     Pickles    black lab      F
2      Lassie       collie      F
3       Snowy  fox terrier      F

### Select the names of all dogs listed in alphabetical order.  Notice that SQL lists the nameless dog first.

In [11]:
#Your code here
q1 = """
SELECT name
FROM dogs
ORDER BY name DESC

;
"""
pd.read_sql(q1, conn)

         name
0       Snowy
1      Snoopy
2      Scooby
3     Pickles
4     McGruff
5  Little Ann
6      Lassie
7    Clifford
8        None

### Select any dog that doesn't have a name

In [12]:
#Your cod
q2 = """
SELECT name
FROM dogs
GROUP BY NULL

;
"""
pd.read_sql(q2, conn)

     name
0  Snoopy

### Select the name and breed of only the hungry dogs and list them from youngest to oldest

In [15]:
#Your code here
q3 = """
SELECT name, breed, age, hungry
FROM dogs
ORDER BY age ASC

;
"""
pd.read_sql(q3, conn)

         name             breed  age  hungry
0      Snoopy            beagle    3       1
1    Clifford           big red    4       1
2        None  golden retriever    4       1
3  Little Ann         coonhound    5       0
4      Scooby        great dane    6       1
5      Lassie            collie    7       1
6       Snowy       fox terrier    8       0
7     McGruff        bloodhound   10       0
8     Pickles         black lab   13       1

### Select the oldest dog's name, age, and temperament

In [13]:
#Your code here
q4 = """
SELECT name, age, temperament
FROM dogs
ORDER BY age DESC

;
"""
pd.read_sql(q4, conn)

         name  age  temperament
0     Pickles   13  mischievous
1     McGruff   10        aware
2       Snowy    8  adventurous
3      Lassie    7       loving
4      Scooby    6       hungry
5  Little Ann    5        loyal
6    Clifford    4       smiley
7        None    4      playful
8      Snoopy    3     friendly

### Select the three youngest dogs

In [18]:
#Your code here
q5 = """
SELECT name, age
FROM dogs
ORDER BY age ASC
LIMIT(3)
;
"""
pd.read_sql(q5, conn)

       name  age
0    Snoopy    3
1  Clifford    4
2      None    4

### Select the name and breed of the dogs who are between five and ten years old, ordered from oldest to youngest

In [19]:
#Your code
q6 = """
SELECT name, breed, age
FROM dogs
ORDER BY age DESC
LIMIT(age = 5, 6, 7, 8, 9, 10)

;
"""
pd.read_sql(q6, conn)

DatabaseError: Execution failed on sql '
SELECT name, breed, age
FROM dogs
ORDER BY age DESC
LIMIT(age = 5, 6, 7, 8, 9, 10)

;
': no such column: age

### Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [ ]:
#Your code here

## Summary

Great work! In this lab you practiced writing more complex SQL statements to not only query specific information but also define the quantity and order of your results.